## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/8894518192)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run Prow application in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-namespace\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"nginx\"\n      - \"docker.io/library/nginx\"\n      - \"prom/pushgateway\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/gardener-project/releases/ci-infra\"\n      - \"gcr.io/k8s-prow\""]
* Update
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner
* Delete
  * module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run Prow application in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-namespace\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"nginx\"\n      - \"docker.io/library/nginx\"\n      - \"prom/pushgateway\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/gardener-project/releases/ci-infra\""]



<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run Prow application in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-namespace\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"nginx\"\n      - \"docker.io/library/nginx\"\n      - \"prom/pushgateway\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/gardener-project/releases/ci-infra\""] will be destroyed
  # (because key ["# Allow images needed to run Prow application in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-namespace\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"nginx\"\n      - \"docker.io/library/nginx\"\n      - \"prom/pushgateway\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/gardener-project/releases/ci-infra\""] is not in for_each map)
  - resource "kubectl_manifest" "constraints" {
      - api_version             = "constraints.gatekeeper.sh/v1beta1" -> null
      - apply_only              = false -> null
      - field_manager           = "kubectl" -> null
      - force_conflicts         = false -> null
      - force_new               = false -> null
      - id                      = "/apis/constraints.gatekeeper.sh/v1beta1/k8sallowedimageses/prow-namespace" -> null
      - kind                    = "K8sAllowedImages" -> null
      - live_manifest_incluster = (sensitive value) -> null
      - live_uid                = "5e99d37c-f554-4dfe-b0d4-0a693bb1bdcc" -> null
      - name                    = "prow-namespace" -> null
      - server_side_apply       = false -> null
      - uid                     = "5e99d37c-f554-4dfe-b0d4-0a693bb1bdcc" -> null
      - validate_schema         = true -> null
      - wait_for_rollout        = true -> null
      - yaml_body               = (sensitive value) -> null
      - yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-namespace
            spec:
              enforcementAction: deny
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - nginx
                - docker.io/library/nginx
                - prom/pushgateway
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/gardener-project/releases/ci-infra
        EOT -> null
      - yaml_incluster          = (sensitive value) -> null
    }

  # module.prow_gatekeeper.kubectl_manifest.constraints["# Allow images needed to run Prow application in Prow cluster.\n\napiVersion: constraints.gatekeeper.sh/v1beta1\nkind: K8sAllowedImages\nmetadata:\n  name: prow-namespace\nspec:\n  enforcementAction: deny\n  match:\n    kinds:\n      - apiGroups: [\"\"]\n        kinds: [\"Pod\"]\n    namespaces:\n      - \"default\"\n  parameters:\n    images:\n      - \"nginx\"\n      - \"docker.io/library/nginx\"\n      - \"prom/pushgateway\"\n      - \"eu.gcr.io/kyma-project\"\n      - \"eu.gcr.io/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/kyma-project\"\n      - \"europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev\"\n      - \"europe-docker.pkg.dev/gardener-project/releases/ci-infra\"\n      - \"gcr.io/k8s-prow\""] will be created
  + resource "kubectl_manifest" "constraints" {
      + api_version             = "constraints.gatekeeper.sh/v1beta1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "K8sAllowedImages"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "prow-namespace"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: constraints.gatekeeper.sh/v1beta1
            kind: K8sAllowedImages
            metadata:
              name: prow-namespace
            spec:
              enforcementAction: deny
              match:
                kinds:
                - apiGroups:
                  - ""
                  kinds:
                  - Pod
                namespaces:
                - default
              parameters:
                images:
                - nginx
                - docker.io/library/nginx
                - prom/pushgateway
                - eu.gcr.io/kyma-project
                - eu.gcr.io/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/kyma-project
                - europe-west3-docker.pkg.dev/sap-kyma-neighbors-dev
                - europe-docker.pkg.dev/gardener-project/releases/ci-infra
                - gcr.io/k8s-prow
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":10572,"Program":"tfcmt","SHA1":"ec445056799b22eefaf38a4f6a48312eacc7bd60","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->